pjalocha/esp32-ogn-tracker/main/hal.cpp
#include <stdint.h>
#include <string.h>
#include <stdbool.h>

#include "hal.h"

#include "driver/gpio.h"
#include "driver/uart.h"
#include "esp_vfs_dev.h"
#include "driver/spi_master.h"
#include "driver/i2c.h"

#include "driver/adc.h"
#include "esp_adc_cal.h"

#if ESP_IDF_VERSION_MINOR>=3
#include "soc/adc_channel.h" // v4.3
#endif

#include "esp_system.h"
#include "esp_freertos_hooks.h"

#if defined(WITH_BT_SPP) || defined(WITH_BLE_SPP)
#include "bt.h"
#endif

#ifdef WITH_LORAWAN
#include "lorawan.h"
#endif

#ifdef WITH_SLEEP
#include "esp_sleep.h"
#endif

#include "nvs.h"
#include "nvs_flash.h"

#ifdef WITH_SPIFFS
#include "esp_vfs_fat.h"
#include "esp_spiffs.h"
#endif

#ifdef WITH_SD
#include "esp_vfs_fat.h"
#include "driver/sdmmc_host.h"
#include "driver/spi_common.h"
#include "driver/sdspi_host.h"
#include "sdmmc_cmd.h"
#endif

#ifdef WITH_AP
#include "ap.h"
#endif
#ifdef WITH_STRATUX
#include "stratux.h"
#endif

#ifdef WITH_BEEPER
#include "driver/ledc.h"
#include "fifo.h"
#endif

#ifdef WITH_SOUND
#include "intmath.h"
#include "driver/i2s.h"
#endif

#ifdef WITH_OLED
#include "ssd1306.h"
#include "font8x8_basic.h"
#endif

#ifdef WITH_U8G2_OLED
#include "u8g2.h"
#endif

#ifdef WITH_TFT_LCD
extern "C" {
#include "tftspi.h"
#include "tft.h"
           }
#endif

#if defined(WITH_ST7789) || defined(WITH_ILI9341)
#include "st7789.h"
#endif

#ifdef WITH_AXP
#include "axp192.h"
#endif

#ifdef WITH_BQ
#include "bq24295.h"
#endif

uint8_t PowerMode = 2;                    // 0=sleep/minimal power, 1=comprimize, 2=full power

// ======================================================================================================
/*
The HELTEC AUtomation board WiFi LoRa 32 with sx1278 (RFM95)

Referenced:   http://esp32.net/
Pinout:       http://esp32.net/images/Heltec/WIFI-LoRa-32/Heltec_WIFI-LoRa-32_DiagramPinoutFromTop.jpg
              http://esp32.net/images/Heltec/WIFI-LoRa-32/Heltec_WIFI-LoRa-32_DiagramPinoutFromBottom.jpg
Arduino code: https://robotzero.one/heltec-wifi-lora-32/
ESP32 API:    https://esp-idf.readthedocs.io/en/latest/api-reference/index.html
UART example: https://github.com/espressif/esp-idf/blob/f4009b94dca9d17b909e1094d6e3d7dbb75d52c0/examples/peripherals/uart_echo
SPI example:  https://github.com/espressif/esp-idf/tree/f4009b94dca9d17b909e1094d6e3d7dbb75d52c0/examples/peripherals/spi_master
I2C example:  https://github.com/espressif/esp-idf/tree/f4009b94dca9d17b909e1094d6e3d7dbb75d52c0/examples/peripherals/i2c
OLED driver:  https://github.com/olikraus/u8g2/tree/master/csrc
OLED datasheet: https://cdn-shop.adafruit.com/datasheets/SSD1306.pdf
OLED example: https://github.com/yanbe/ssd1306-esp-idf-i2c
OLED article: http://robotcantalk.blogspot.co.uk/2015/03/interfacing-arduino-with-ssd1306-driven.html

SX1276 pins:
14 = GPIO14 = RST
 5 = GPIO5  = SCK
18 = GPIO18 = CS  = SS
19 = GPIO19 = MISO
27 = GPIO27 = MOSI
26 = GPIO26 = IRQ = DIO0

OLED type: U8X8_SSD1306_128X64_NONAME_SW_I2C u8x8 (by Arduino)
OLED pins:
16 = GPIO16 = RST
 4 = GPIO04 = SDA
15 = GPIO15 = SCL

LED pin:
25 = GPIO25

Button pin:
 0 = GPIO0

UART0 pins: taken by console ?
 1 = GPIO1 = TxD  CPU->GPS
 3 = GPIO3 = RxD  GPS->CPU

GPS pins:
22 = GPIO22 = PPS
23 = GPIO23 = ENA

UART2 pins:
16 = GPIO16 = RxD -> taken by OLED ?
17 = GPIO17 = TxD

T-Beam board pinout and docs: http://tinymicros.com/wiki/TTGO_T-Beam

HPD13A = RF chip ?
23 = RST (?)
 5 = SCK
18 = NSS = CS
19 = MISO
27 = MOSI
26 = IO0 = IRQ

24AA32A = 32K I2C EEPROM => GPS I2C

GPS
12 = GPIO12 = RXD1
15 = GPIO15 = TXD1

PSRM32 = SDIO ?
16 = CS

21 = GPIO21 = green LED

*/
/*
https://randomnerdtutorials.com/esp32-pinout-reference-gpios/

GPIO   HELTEC      TTGO       JACEK     M5_JACEK    T-Beam     T-Beamv10    FollowMe   OGN_AKR             Restrictions

 0    Button      Button                .           LCD/DC     LCD/DC                  .                   Can lock the boot, better not pull it down
 1    CONS/TxD    CONS/TxD   CONS/TxD   CONS/TxD    CONS/TxD   CONS/TxD                CONS/TxD            Console/Program
 2                           SD/MISO    .           LCD/MOSI   LCD/MOSI     LED/DBG    LED/DBG             Bootstrap: LOW to enter UART download mode
 3    CONS/RxD    CONS/RxD   CONS/RxD   CONS/RxD    CONS/RxD   CONS/RxD                CONS/RxD            Console/Program
 4    OLED/SDA    OLED/SDA   ADC/CS                 LCD/BCKL   LCD/BCKL     PERF/RST   RF_RST
 5    RF/SCK      RF/SCK     RF/SCK     GPS/ANT     RF/SCK     RF/SCK       RF/CS      RF/CS               PWM at boot
 6                                      SD/CLK                              SD/CLK                         SD/CLK              SPI flash
 7                                      SD/DATA0                                                           SD/DATA0            SPI flash
 8                                      SD/DATA1                                                           SD/DATA1            SPI flash
 9                                      SD/DATA2                                                           SD/DATA2            SPI flash
10                                      SD/DATA3                                                           SD/DATA3            SPI flash
11                                      SD/CMD                              SD/CMD                         SD/CMD              SPI flash
12    GPS/RxD     GPS/RxD    SD/CS      GPS/RxD                GPS/TxD      SD/MISO    SD/MISO             HSPI/MISO JTAG/TDI  Bootstrap: select output voltage to power the flash chip
13    GPS/Ena     GPS/Ena    SD/SCK     LCD/SCL     LCD/CLK    LCD/CLK      SD/MOSI    SD/MOSI             HSPI/MOSI JTAG/TCK
14    RF/RST      RF/RST     Beeper     ?           LED/PCB    .            SD/CLK     SD/SCK              HSPI/CLK  JTAG/TMS  PWM at boot
15    OLED/SCL    OLED/SCL   SD/MOSI    GPS/TxD                .            HSPI/CS0   SD/CS               JTAG/TDO            PWM at boot
16    OLED/RST    OLED/RST   RF/IRQ                 GPS/Tx     RAM/CS       GPS/TX     GPS/TX              U2_RXD
17    Beeper      Beeper     RF/RST                 GPS/Rx     Beeper       GPS/RX     GPS/RX              U2_TXD
18    RF/CS       RF/CS      RF/MISO    RF/CS       RF/SCK     RF/CS                   RF/SCK              VSPI/CLK
19    RF/MISO     RF/MISO    RF/MOSI    RF/MISO     RF/MISO    RF/MISO      RF/MISO    RF/MISO             VSPI/MISO
20                                                                                                         not listed
21                LED?       RF/CS      I2C/SCL     I2C/SDA    I2C/SDA      I2C/SDA    I2C/SDA             VSPI/QUADHP
22                .          PWR/ON     I2C/SDA     I2C/CLK    I2C/SCL                 I2C/SCL             VSPI/QUADWP
23                .          PWR/LDO    RF/RST      RF/MOSI    RF/RST       RF/MOSI    RF/MOSI             VSPI/MOSI
24                                                                                                         not listed
25    LED         Speaker    .          Speaker     Speaker    Speaker      TT/RX      Speaker
26    RF/IRQ      RF/IRQ     SCL        RF/IRQ      RF/IRQ     RF/IRQ       PWR/Good   EncoderA
27    RF/MOSI     RF/MOSI    SDA                    RF/MOSI    RF/MOSI      TT/TX      EncoderB
28                                                                                                         not listed
29                                                                                                         not listed
30                                                                                                         not listed
31                                                                                                         not listed
32    .           .          GPS/TxD    ?                      .            TT/RST     GPS/PPS             XTAL
33    .           .          OLED/RST   ?                      .            GPS/EN     RF/IRQ              XTAL
34    GPS/PPS     GPS/PPS    GPS/RxD    KNOB/Sense             GPS/TxD      GPS/PPS    Button
35    GPS/TxD     GPS/TxD    GPS/PPS    BAT/Sense              AXP/IRQ      RF/IRQ     Vbat/Sense
36    .           .          BAT/Sense  BAT/Ext.               .            Vbat/Sense LED/TX
37    .           .                                            GPS/PPS
38    .           .          Button                                         Button
39    .           .                     Button      Button     Button

*/


#ifdef WITH_TTGO
#define PIN_LED_PCB  GPIO_NUM_2   // status LED on the PCB
#endif

#if defined(WITH_HELTEC) || defined(WITH_HELTEC_V2)
#define PIN_LED_PCB  GPIO_NUM_25  // status LED on the PCB: 25, GPIO25 is DAC2
#endif

