pjalocha/esp32-ogn-tracker/main/hal.cpp
#if defined(WITH_TBEAM) // || defined(WITH_TBEAM_V10)
#define PIN_LED_PCB  GPIO_NUM_14  // blue LED on the PCB: 14
// #define PIN_LED_PCB_INV
#endif

#ifdef WITH_FollowMe
#define PIN_LED_PCB  GPIO_NUM_2   // debug LED
#define PIN_LED_TX   GPIO_NUM_15
#ifdef WITH_BQ
#define PIN_POWER_GOOD GPIO_NUM_26
#endif
#endif

#ifdef WITH_OGN_AKR
#define PIN_LED_PCB  GPIO_NUM_2   // debug LED
#define PIN_LED_TX   GPIO_NUM_36  // debug LED
#endif

// #define PIN_LED_TX   GPIO_NUM_??
// #define PIN_LED_RX   GPIO_NUM_??

#ifdef WITH_JACEK
#define PIN_RFM_RST  GPIO_NUM_17  // Reset
#define PIN_RFM_IRQ  GPIO_NUM_16  // packet done on receive or transmit
#define PIN_RFM_SS   GPIO_NUM_21  // SPI chip-select
#define PIN_RFM_SCK  GPIO_NUM_5   // SPI clock
#define PIN_RFM_MISO GPIO_NUM_18  // SPI MISO
#define PIN_RFM_MOSI GPIO_NUM_19  // SPI MOSI
#endif // JACEK

#ifdef WITH_M5_JACEK
#define PIN_RFM_RST  GPIO_NUM_13  // Reset
#define PIN_RFM_IRQ  GPIO_NUM_35  // Packet done on receive or transmit
#define PIN_RFM_SS   GPIO_NUM_12  // SPI chip-select
#define PIN_RFM_SCK  GPIO_NUM_18  // SPI clock (same as LCD)
#define PIN_RFM_MISO GPIO_NUM_19  // SPI MISO  (save as LCD)
#define PIN_RFM_MOSI GPIO_NUM_23  // SPI MOSI  (save as LCD)
#endif // M5_JACEK

#if defined(WITH_HELTEC) || defined(WITH_HELTEC_V2) || defined(WITH_TTGO)
#define PIN_RFM_RST  GPIO_NUM_14  // Reset
#define PIN_RFM_IRQ  GPIO_NUM_26  // packet done on receive or transmit
#define PIN_RFM_SS   GPIO_NUM_18  // SPI chip-select
#define PIN_RFM_SCK  GPIO_NUM_5   // SPI clock
#define PIN_RFM_MISO GPIO_NUM_19  // SPI MISO
#define PIN_RFM_MOSI GPIO_NUM_27  // SPI MOSI
#endif // HELTEC TTGO

#if defined(WITH_TBEAM) || defined(WITH_TBEAM_V10) || defined(WITH_LORA32)
#define PIN_RFM_RST  GPIO_NUM_23  // Reset - not clear if T-Beam is using it, or maybe only the older version
#define PIN_RFM_IRQ  GPIO_NUM_26  // packet done on receive or transmit
#define PIN_RFM_SS   GPIO_NUM_18  // SPI chip-select
#define PIN_RFM_SCK  GPIO_NUM_5   // SPI clock
#define PIN_RFM_MISO GPIO_NUM_19  // SPI MISO
#define PIN_RFM_MOSI GPIO_NUM_27  // SPI MOSI
#endif // TBEAM

#ifdef WITH_TBEAM_V10
#ifdef WITH_SX1262
#define PIN_RFM_BUSY GPIO_NUM_32  // for the T-Beam with SX1262 (watch for conflict with the LCD)
#endif
#endif

#ifdef WITH_FollowMe
// #define PIN_RFM_RST  GPIO_NUM_32  // Reset
#define PIN_RFM_IRQ  GPIO_NUM_35  // 39 // packet done on receive or transmit
#define PIN_RFM_SS   GPIO_NUM_5   // SPI chip-select
#define PIN_RFM_SCK  GPIO_NUM_18  // SPI clock
#define PIN_RFM_MISO GPIO_NUM_19  // SPI MISO
#define PIN_RFM_MOSI GPIO_NUM_23  // SPI MOSI
#endif // FollowMe

#ifdef WITH_OGN_AKR
#define PIN_RFM_IRQ  GPIO_NUM_33  // 39 // packet done on receive or transmit
#define PIN_RFM_SS   GPIO_NUM_5   // SPI chip-select
#define PIN_RFM_SCK  GPIO_NUM_18  // SPI clock
#define PIN_RFM_MISO GPIO_NUM_19  // SPI MISO
#define PIN_RFM_MOSI GPIO_NUM_23  // SPI MOSI
#define PIN_RFM_RST  GPIO_NUM_4   // RFM RESET
#endif

#define RFM_SPI_HOST  VSPI_HOST   // or H or VSPI_HOST ?
#define RFM_SPI_DMA   1           // DMA channel
#define RFM_SPI_SPEED 4000000     // [Hz] 2MHz SPI clock rate for RF chip

#ifdef WITH_ST7789
#ifdef WITH_TBEAM                  // old T-Beam
#define LCD_PIN_MOSI GPIO_NUM_2    // SDA
#define LCD_PIN_MISO GPIO_NUM_NC   // MISO not connected
#define LCD_PIN_CLK  GPIO_NUM_13   // SCL
#endif // TBEAM
#ifdef WITH_TBEAM_V10              // new T-Beam
#define LCD_PIN_MOSI GPIO_NUM_14   // 13   // SDA
#define LCD_PIN_MISO GPIO_NUM_NC   // MISO not connected
#define LCD_PIN_CLK  GPIO_NUM_13   // 2   // SCL
// #define LCD_PIN_MOSI GPIO_NUM_2 // 13   // SDA
// #define LCD_PIN_MISO GPIO_NUM_NC   // MISO not connected
// #define LCD_PIN_CLK  GPIO_NUM_13 // 14   // SCL
// #define LCD_PIN_RST  GPIO_NUM_15 // NC  // RST
#endif // TBEAM v1.0
#define LCD_SPI_SPEED 10000000     // [Hz]
#define LCD_SPI_HOST HSPI_HOST     // VSPI_HOST or HSPI_HOST
#define LCD_SPI_DMA          2     // DMA channel
#define LCD_SPI_MODE         3     // for ST7789 with CS tied to LOW
#endif

#ifdef WITH_JACEK
#define PIN_GPS_TXD  GPIO_NUM_32
#define PIN_GPS_RXD  GPIO_NUM_34
#define PIN_GPS_PPS  GPIO_NUM_35
#endif // JACEK

#ifdef WITH_M5_JACEK
#define PIN_GPS_TXD  GPIO_NUM_17
#define PIN_GPS_RXD  GPIO_NUM_16
#define PIN_GPS_PPS  GPIO_NUM_26
#endif // M5_JACEK

#ifdef WITH_LORA32
#define PIN_GPS_TXD  GPIO_NUM_12
#define PIN_GPS_RXD  GPIO_NUM_35
#define PIN_GPS_PPS  GPIO_NUM_34
#define PIN_GPS_ENA  GPIO_NUM_13
#endif // LORA32

#ifdef WITH_TBEAM_V10
#define PIN_AXP_IRQ GPIO_NUM_35
#endif

#if defined(WITH_HELTEC) || defined(WITH_TTGO)
                                  // VK2828U   GN-801   MAVlink
#define PIN_GPS_TXD  GPIO_NUM_13  // green     green    green
#define PIN_GPS_RXD  GPIO_NUM_35 // blue      yellow   yellow
#define PIN_GPS_PPS  GPIO_NUM_34 // white     blue
// #define PIN_GPS_RXD  GPIO_NUM_38  // for a new HELTEC
// #define PIN_GPS_PPS  GPIO_NUM_37  // for a new HELTEC
// #define PIN_GPS_ENA  GPIO_NUM_13  // yellow    white
#endif // HELTEC || TTGO

#if defined(WITH_HELTEC_V2)
                                  // VK2828U   GN-801   MAVlink
#define PIN_GPS_TXD  GPIO_NUM_13  // green     green    green
#define PIN_GPS_RXD  GPIO_NUM_39 // blue      yellow   yellow
#define PIN_GPS_PPS  GPIO_NUM_38 // white     blue
#endif

// Note: I had a problem with GPS ENABLE on GPIO13, thus I tied the enable wire to 3.3V for the time being.

#ifdef WITH_TBEAM
#define PIN_GPS_TXD  GPIO_NUM_15
#define PIN_GPS_RXD  GPIO_NUM_12
#endif // TBEAM

#ifdef WITH_TBEAM_V10
#define PIN_GPS_TXD  GPIO_NUM_12
#define PIN_GPS_RXD  GPIO_NUM_34
#define PIN_GPS_PPS  GPIO_NUM_37
#endif // TBEAM v1.0

#ifdef WITH_FollowMe              // L80 GPS with PPS, Enable and Reset
#define PIN_GPS_TXD  GPIO_NUM_17
#define PIN_GPS_RXD  GPIO_NUM_16
#define PIN_GPS_PPS  GPIO_NUM_34  // high active
#define PIN_GPS_ENA  GPIO_NUM_33  // Enable: high-active

#define PIN_PERIPH_RST GPIO_NUM_4   // Reset: high-active
#endif

#ifdef WITH_OGN_AKR              // L86-M33 GPS with PPS
#define PIN_GPS_TXD  GPIO_NUM_17
#define PIN_GPS_RXD  GPIO_NUM_16
#define PIN_GPS_PPS  GPIO_NUM_32  // high active
#endif

#define CONS_UART UART_NUM_0      // UART0 for the console (the system does this for us)
#define GPS_UART  UART_NUM_1      // UART1 for GPS data read and dialog

