pjalocha/esp32-ogn-tracker/main/hal.cpp
#define I2C_BUS     I2C_NUM_1     // use bus #1 to talk to OLED and Baro sensor

#ifdef WITH_FollowMe
#define AERO_UART     UART_NUM_2  // UART2
#define PIN_AERO_TXD  GPIO_NUM_25
#define PIN_AERO_RXD  GPIO_NUM_27
#endif

uint8_t BARO_I2C = (uint8_t)I2C_BUS;

#ifdef WITH_JACEK
#define PIN_I2C_SCL GPIO_NUM_26   // SCL pin
#define PIN_I2C_SDA GPIO_NUM_27   // SDA pin
#endif // JACEK

#if defined(WITH_M5_JACEK) || defined(WITH_OGN_AKR)
#define PIN_I2C_SCL GPIO_NUM_22   // SCL pin
#define PIN_I2C_SDA GPIO_NUM_21   // SDA pin
#endif // M5_JACEK || WITH_OGN_AKR

#if defined(WITH_HELTEC) || defined(WITH_HELTEC_V2) || defined(WITH_TTGO)
#define PIN_I2C_SCL GPIO_NUM_15   // SCL pin
#define PIN_I2C_SDA GPIO_NUM_4    // SDA pin
#define OLED_I2C_ADDR 0x3C        // I2C address of the OLED display
#define PIN_OLED_RST GPIO_NUM_16  // OLED RESET: low-active
#endif // HELTEC || TTGO

#if defined(WITH_TBEAM) || defined(WITH_TBEAM_V10) || defined(WITH_LORA32) // T-Beam
#define PIN_I2C_SCL GPIO_NUM_22   // SCL pin => this way the pin pattern fits the BMP280 module
#define PIN_I2C_SDA GPIO_NUM_21   // SDA pin
#define OLED_I2C_ADDR 0x3C        // I2C address of the OLED display
#endif // TBEAM

#ifdef WITH_FollowMe              //
#define PIN_I2C_SCL GPIO_NUM_22   // SCL pin
#define PIN_I2C_SDA GPIO_NUM_21   // SDA pin
#define OLED_I2C_ADDR 0x3C        // I2C address of the OLED display
// #define PIN_OLED_RST GPIO_NUM_15  // OLED RESET: low-active
#endif

// #if defined(WITH_HELTEC) || defined(WITH_TTGO)
// #define PIN_OLED_RST GPIO_NUM_16  // OLED RESET: low-active
// #endif

#ifdef WITH_LORA32
#define PIN_SD_CS     GPIO_NUM_13 // SD card interface in SPI mode
#define PIN_SD_SCK    GPIO_NUM_14
#define PIN_SD_MISO   GPIO_NUM_2
#define PIN_SD_MOSI   GPIO_NUM_15
#define SD_SPI_DMA              2
#endif

#ifdef WITH_JACEK

#define PIN_OLED_RST  GPIO_NUM_33 // OLED RESET: low-active
#define OLED_I2C_ADDR 0x3C        // I2C address of the OLED display

#define PIN_POWER     GPIO_NUM_22 // power to GPS, RF, ...
#define PIN_POWER_LDO GPIO_NUM_23 // LOW=low power LDO, HIGH=higher power LDO

#define PIN_SD_CS     GPIO_NUM_12 // SD card interface in SPI mode
#define PIN_SD_SCK    GPIO_NUM_13
#define PIN_SD_MISO   GPIO_NUM_2
#define PIN_SD_MOSI   GPIO_NUM_15
#define SD_SPI_DMA              2

#define PIN_BEEPER    GPIO_NUM_14

#endif // JACEK

#if defined(WITH_TBEAM) || defined(WITH_TBEAM_V10)
#define PIN_BEEPER    GPIO_NUM_25 // same as DAC
#endif // TBEAM

#if defined(WITH_HELTEC) || defined(WITH_HELTEC_V2) || defined(WITH_TTGO)
#define PIN_BEEPER    GPIO_NUM_17
#endif // HELTEC || TTGO

#ifdef WITH_OGN_AKR
#define PIN_BEEPER    GPIO_NUM_25
#endif

#ifdef WITH_M5_JACEK

#define PIN_GPS_ANT   GPIO_NUM_5  // internal(H) or external(L) GPS antenna

#define PIN_SD_CS     GPIO_NUM_11 // SD card interface in SPI mode
#define PIN_SD_SCK    GPIO_NUM_6
#define PIN_SD_MISO   GPIO_NUM_7
#define PIN_SD_MOSI   GPIO_NUM_8
#define SD_SPI_DMA             2

#define PIN_BEEPER    GPIO_NUM_25 // DAC

#endif // M5_JACEK

#if !defined(WITH_AXP) && !defined(WITH_BQ) && !defined(WITH_OLED) && !defined(WITH_U8G2_OLED) && !defined(WITH_BMP180) && !defined(WITH_BMP280) && !defined(WITH_BME280)
#undef PIN_I2C_SCL
#undef PIN_I2C_SDA
#endif

#if defined(WITH_FollowMe) || defined(WITH_OGN_AKR)
#define PIN_SD_MISO   GPIO_NUM_12 // SD card in simple SPI mode, using HSPI IOMUX pins
#define PIN_SD_MOSI   GPIO_NUM_13
#define PIN_SD_SCK    GPIO_NUM_14
#define PIN_SD_CS     GPIO_NUM_15
#define SD_SPI_DMA              2
#endif // FollowMe || WITH_OGN_AKR

#ifdef WITH_M5_JACEK              // the three buttons below the LCD

#define PIN_BUTTON_L  GPIO_NUM_37 // Left
#define PIN_BUTTON    GPIO_NUM_38 // Center
#define PIN_BUTTON_R  GPIO_NUM_39 // Right

#endif

#if defined(WITH_FollowMe) // || defined(WITH_TBEAM) || defined(WITH_TBEAM_V10)
#define PIN_BUTTON    GPIO_NUM_39 // or 38 ?
#endif

#if defined(WITH_TBEAM_V10)
#define PIN_BUTTON    GPIO_NUM_38
#endif

#ifdef WITH_JACEK
#define PIN_BUTTON    GPIO_NUM_38
#endif

#ifdef WITH_OGN_AKR
#define PIN_BUTTON    GPIO_NUM_34
#endif

#if defined(WITH_TTGO) || defined(WITH_HELTEC) || defined(WITH_HELTEC_V2)
#define PIN_BUTTON    GPIO_NUM_0
#endif

#ifndef PIN_BUTTON
#define PIN_BUTTON    GPIO_NUM_39
#endif

// ======================================================================================================

FIFO<uint8_t, 8> KeyBuffer;

// ======================================================================================================
// 48-bit unique ID of the chip

uint64_t getUniqueID(void)
{ uint8_t MAC[6]; esp_efuse_mac_get_default(MAC);
  uint64_t ID=MAC[0];
  for(int Idx=1; Idx<6; Idx++)
  { ID<<=8; ID|=MAC[Idx]; }
  return ID; }

uint32_t getUniqueAddress(void)
{ return getUniqueID()&0x00FFFFFF; }

/*
uint64_t getUniqueID(void)
{ uint64_t ID=0; esp_err_t ret=esp_efuse_mac_get_default((uint8_t *)&ID); return ID; }

uint32_t getUniqueAddress(void)
{ uint32_t ID = getUniqueID()>>24;
  ID &= 0x00FFFFFF;
  ID = (ID>>16) | (ID&0x00FF00) | (ID<<16);
  ID &= 0x00FFFFFF;
  return ID; }
*/
// ======================================================================================================

#ifdef WITH_MAVLINK
uint8_t  MAV_Seq=0;                   // sequence number for MAVlink message sent out
#endif

// ======================================================================================================

// system_get_time()  - return s 32-bit time in microseconds since the system start
// gettimeofday()
// xthal_get_ccount() - gets Xtal or master clock counts ?

// ======================================================================================================

FlashParameters Parameters;

#ifdef WITH_LORAWAN
LoRaWANnode WANdev;
#endif

//--------------------------------------------------------------------------------------------------------
// Power control

#ifdef WITH_JACEK
void POWER_Dir    (void) { gpio_set_direction(PIN_POWER, GPIO_MODE_OUTPUT); }
void POWER_On     (void) { gpio_set_level(PIN_POWER, 0); }      //
void POWER_Off    (void) { gpio_set_level(PIN_POWER, 1); }
void POWER_LDO_Dir(void) { gpio_set_direction(PIN_POWER_LDO, GPIO_MODE_OUTPUT); }
void POWER_LDO_On (void) { gpio_set_level(PIN_POWER_LDO, 1); }  //
void POWER_LDO_Off(void) { gpio_set_level(PIN_POWER_LDO, 0); }
#endif

#ifdef WITH_M5_JACEK
void GPS_ANT_Dir (void)              { gpio_set_direction(PIN_GPS_ANT, GPIO_MODE_OUTPUT); }
void GPS_ANT_Sel (uint8_t Antenna=1) { gpio_set_level(PIN_GPS_ANT, Antenna); } // 1=internal, 0=external
#endif

#ifdef PIN_POWER_GOOD
bool Power_isGood(void) { return gpio_get_level(PIN_POWER_GOOD); }
#endif

//--------------------------------------------------------------------------------------------------------
// Status LED on the PCB

