pjalocha/esp32-ogn-tracker/main/hal.cpp
#ifdef PIN_GPS_PPS
  gpio_set_direction(PIN_GPS_PPS, GPIO_MODE_INPUT);
#endif
#ifdef PIN_GPS_RST
  gpio_set_direction(PIN_GPS_RST, GPIO_MODE_OUTPUT);
  gpio_set_level(PIN_GPS_RST, 0);
#endif
#ifdef PIN_GPS_ENA
  gpio_set_direction(PIN_GPS_ENA, GPIO_MODE_OUTPUT);
  GPS_ENABLE();
// #ifdef WITH_GPS_MTK
//   gpio_set_level(PIN_GPS_ENA, 0);                       //
// #else
//   gpio_set_level(PIN_GPS_ENA, 1);                       //
// #endif
#endif

#ifdef GPS_UART
  uart_config_t GPS_UART_Config =                       // GPS UART
  { baud_rate : 4800,
    data_bits : UART_DATA_8_BITS,
    parity    : UART_PARITY_DISABLE,
    stop_bits : UART_STOP_BITS_1,
    flow_ctrl : UART_HW_FLOWCTRL_DISABLE,
    rx_flow_ctrl_thresh: 0,
    use_ref_tick: 0
  };
  uart_param_config  (GPS_UART, &GPS_UART_Config);
  uart_set_pin       (GPS_UART, PIN_GPS_TXD, PIN_GPS_RXD, UART_PIN_NO_CHANGE, UART_PIN_NO_CHANGE);
  uart_driver_install(GPS_UART, 256, 256, 0, 0, 0);
#endif

#ifdef AERO_UART
  uart_config_t AERO_UART_Config =                      // AERO UART
  { baud_rate : 115200,
    data_bits : UART_DATA_8_BITS,
    parity    : UART_PARITY_DISABLE,
    stop_bits : UART_STOP_BITS_1,
    flow_ctrl : UART_HW_FLOWCTRL_DISABLE,
    rx_flow_ctrl_thresh: 0,
    use_ref_tick: 0
  };
  uart_param_config  (AERO_UART, &AERO_UART_Config);
  uart_set_pin       (AERO_UART, PIN_AERO_TXD, PIN_AERO_RXD, UART_PIN_NO_CHANGE, UART_PIN_NO_CHANGE);
  uart_driver_install(AERO_UART, 256, 256, 0, 0, 0);
#endif

#if defined(WITH_OLED) || defined(WITH_U8G2_OLED)
#ifdef PIN_OLED_RST
  gpio_set_direction(PIN_OLED_RST, GPIO_MODE_OUTPUT);
#endif
#endif

#if defined(PIN_I2C_SCL) && defined(PIN_I2C_SDA)
  i2c_config_t I2C_Config =                            // I2C for OLED and pressue sensor
  { mode          : I2C_MODE_MASTER,
    sda_io_num    : PIN_I2C_SDA,
#if ESP_IDF_VERSION_MINOR<1
    sda_pullup_en : GPIO_PULLUP_ENABLE,
    scl_io_num    : PIN_I2C_SCL,
#else                                                  // order of the elements has changed in 4.1
    scl_io_num    : PIN_I2C_SCL,
    sda_pullup_en : GPIO_PULLUP_ENABLE,
#endif
    scl_pullup_en : GPIO_PULLUP_ENABLE
  } ;
  I2C_Config.master.clk_speed =  I2C_SPEED;
  i2c_param_config  (I2C_BUS, &I2C_Config);
  i2c_driver_install(I2C_BUS, I2C_Config.mode, 0, 0, 0);
#endif

#ifdef WITH_BQ
  gpio_set_direction(PIN_POWER_GOOD, GPIO_MODE_INPUT);
  BQ.Bus=(uint8_t)I2C_BUS;
  BQ.checkID();
  // BQ.writeSource(0x05);     // Reg #00
  // BQ.writePowerON(0x2F);    // Reg #01, disable charging
  BQ.writeChargeCurr(0x20); // Reg #02 00 = 512mA, 0x20 = 512+512mA
  BQ.writePreCharge(0x00);  // Reg #03
  BQ.writeChargeVolt(0x9A); // Reg #04
  // BQ.writePowerON(0x3F);    // Reg #01, enable charging
  BQ.writeTimerCtrl(0x8C);  // Reg #05, disable the watchdog, so it always stays in host-mode, not default-mode
  // BQ.writeTimerCtrl(0x9C);  // REG #05, enable the watchdog
#endif

#ifdef WITH_AXP
  gpio_set_direction(PIN_AXP_IRQ, GPIO_MODE_INPUT);
  AXP.Bus=(uint8_t)I2C_BUS;
#ifdef DEBUG_PRINT
  xSemaphoreTake(CONS_Mutex, portMAX_DELAY);
  Format_String(CONS_UART_Write, "AXP192: ");
  Format_Hex(CONS_UART_Write, AXP.readIRQ1());
  Format_Hex(CONS_UART_Write, AXP.readIRQ2());
  Format_Hex(CONS_UART_Write, AXP.readIRQ3());
  Format_Hex(CONS_UART_Write, AXP.readIRQ4());
  Format_String(CONS_UART_Write, "\n");
  xSemaphoreGive(CONS_Mutex);
#endif
  AXP.checkID();
  AXP.setPOK(0xDC);                      // power-on = 11 = 1sec, long-press = 01 = 1.5sec, power-off = enable, PWROK delay = 64ms, power-off = 00 = 4sec
  uint8_t PwrStatus = AXP.readStatus();
  AXP.setLED(1);
  AXP.setPowerOutput(AXP.OUT_DCDC1, 1);  // 3.3V on the pin header for LCD and BME280
  AXP.setDCDC1(3300);
  // vTaskDelay(100);
  AXP.setPowerOutput(AXP.OUT_LDO2,  1);  // RFM power
  // vTaskDelay(100);
  AXP.setPowerOutput(AXP.OUT_LDO3,  1);  // GPS power
  // vTaskDelay(100);
  AXP.enableBatMon();                    // enable battery charge/discharge current counters
  AXP.enableADC(AXP.ADC_BAT_VOLT | AXP.ADC_BAT_CURR | AXP.ADC_VBUS_VOLT | AXP.ADC_VBUS_CURR);
  // AXP.SetPowerOutput(AXP.OUT_DCDC2); // not used on T-Beam
  // AXP.SetPowerOutput(AXP.OUT_DCDC3); // DCDC3 is a feedback from VDD3V3 ?
  // AXP.SetPowerOutput(AXP.OUT_EXTEN); // seems only wired to a test pin ?
  AXP.enableIRQ(AXP.AXP202_PEK_LONGPRESS_IRQ | AXP.AXP202_PEK_SHORTPRESS_IRQ, 1);
  AXP.clearIRQ();
  // vTaskDelay(500);
#endif

#ifdef WITH_OLED
#ifdef PIN_OLED_RST
  OLED_RESET(0);
  vTaskDelay(10);
  OLED_RESET(1);
#endif
  vTaskDelay(10);
  OLED_Init(0);
  OLED_Clear(0);
  OLED_SetContrast(128, 0);
#ifdef WITH_OLED2
  OLED_Init(1);
  OLED_Clear(1);
  OLED_SetContrast(128, 1);
#endif
#endif

#ifdef WITH_U8G2_OLED
  U8G2_Init();
#endif

  RFM_IRQ_SetInput();
#ifdef WITH_SX1262
  RFM_Busy_SetInput();
#endif
  RFM_RESET_SetOutput();
  RFM_RESET(0);

  spi_bus_config_t BusCfg =                               // RF/LCD chip SPI
  { mosi_io_num     : PIN_RFM_MOSI,
    miso_io_num     : PIN_RFM_MISO,
    sclk_io_num     : PIN_RFM_SCK,
    quadwp_io_num   : -1,
    quadhd_io_num   : -1,
#ifdef WITH_ILI9341                                       // ILI9341 is connected to same SPI as RFM and it needs larger buffer
    max_transfer_sz : LCD_BUFF_SIZE*2+8,
#else
    max_transfer_sz : 64,
#endif
    flags           : SPICOMMON_BUSFLAG_MASTER | SPICOMMON_BUSFLAG_SCLK | SPICOMMON_BUSFLAG_MISO | SPICOMMON_BUSFLAG_MOSI,
    intr_flags      : 0 // ESP_INTR_FLAG_SHARED  ESP_INTR_FLAG_INTRDISABLED
  };

  spi_device_interface_config_t DevCfg =
  { command_bits     : 0,
    address_bits     : 0,
    dummy_bits       : 0,
    mode             : 0,
    duty_cycle_pos   : 0,
    cs_ena_pretrans  : 0,
    cs_ena_posttrans : 0,
    clock_speed_hz   : RFM_SPI_SPEED,
    input_delay_ns   : 0,
    spics_io_num     : PIN_RFM_SS,
    flags            : 0,
    queue_size       : 1,
    pre_cb           : 0,
    post_cb          : 0
  };
  esp_err_t ret=spi_bus_initialize(RFM_SPI_HOST, &BusCfg,  RFM_SPI_DMA); // RFM/LCD SPI bus
            ret=spi_bus_add_device(RFM_SPI_HOST, &DevCfg, &RFM_SPI);     // RFM SPI device

