pjalocha/esp32-ogn-tracker/main/hal.cpp
#ifdef WITH_TFT_LCD
  TFT_LCD_Init();
#endif

#ifdef WITH_ST7789

  spi_bus_config_t BusConfig =    // SPI bus setup
  {
    .mosi_io_num = LCD_PIN_MOSI,
    .miso_io_num = LCD_PIN_MISO,
    .sclk_io_num = LCD_PIN_CLK,
    .quadwp_io_num = GPIO_NUM_NC,
    .quadhd_io_num = GPIO_NUM_NC,
    .max_transfer_sz = LCD_BUFF_SIZE*2+8,
    .flags = 0,
    .intr_flags = 0
  };

  ret = spi_bus_initialize(LCD_SPI_HOST, &BusConfig, LCD_SPI_DMA);  // Initialize the SPI bus

  LCD_WIDTH=240; LCD_HEIGHT=240;
  LCD_TYPE=0;
#ifdef WITH_TBEAM_V10
  LCD_PIN_RST = GPIO_NUM_33;
  LCD_PIN_DC  = GPIO_NUM_2;
  LCD_PIN_BCKL = GPIO_NUM_15; // on one baord it is 32
#endif
  LCD_Init(LCD_SPI_HOST, LCD_SPI_MODE, LCD_SPI_SPEED);
  LCD_Start();
#endif

#ifdef WITH_ILI9341             // M5stack or HELTEC configuration
#define LCD_SPI_SPEED 26000000  // [Hz]
#define LCD_SPI_MODE         0  //
#ifdef WITH_HELTEC_V2
  LCD_PIN_CS   = GPIO_NUM_23;
  LCD_PIN_DC   = GPIO_NUM_17;
  LCD_PIN_RST  = GPIO_NUM_NC;
  LCD_PIN_BCKL = GPIO_NUM_12;
#endif
#if defined(WITH_TBEAM) || defined(WITH_TBEAM_V10)
  LCD_PIN_CS   = GPIO_NUM_32;   // CS: low active
  LCD_PIN_DC   = GPIO_NUM_2;    // D/C: Command = 0, Data = 1
  LCD_PIN_RST  = GPIO_NUM_33;   // Reset: low active
  LCD_PIN_BCKL = GPIO_NUM_15;   // Back-light: HIGH active
#endif
#ifdef WITH_M5_JACEK
  LCD_PIN_CS   = GPIO_NUM_14;   //
  LCD_PIN_DC   = GPIO_NUM_27;   // D/C: Command = 0, Data = 1
  LCD_PIN_RST  = GPIO_NUM_33;   //
  LCD_PIN_BCKL = GPIO_NUM_32;   // Back-light: HIGH active
#endif
  LCD_WIDTH=320; LCD_HEIGHT=240;
  LCD_TYPE = 1;                 // 1 = ILI9341
  LCD_Init(RFM_SPI_HOST, LCD_SPI_MODE, LCD_SPI_SPEED);
  LCD_Start();
#endif

#ifdef WITH_SD
  SD_Init();
#endif

#ifdef WITH_BEEPER
  Beep_Init();
#endif

#ifdef WITH_SOUND
  Sound_Init();
  // Sound_PlayU8(Sound_737_Traffic_u8, Sound_737_Traffic_size);
  // Sound_PlayU8(Sound_737_Whoop_Whoop_u8, Sound_737_Whoop_Whoop_size);
  // Sound_PlayU8(Sound_737_Sink_Rate_u8, Sound_737_Sink_Rate_size);
  // for( uint16_t Freq=0x400; Freq<=0x1000; Freq<<=1)
  // { Sound_Beep(Freq, 4000, 0x2000); }
#endif

  ADC_Init();

  // esp_register_freertos_tick_hook(&vApplicationTickHook);

}

// ======================================================================================================

extern "C"
void vTaskTICK(void* pvParameters)
{
  for( ; ; )
  { vTaskDelay(1);
    LED_TimerCheck(1);

#ifdef WITH_BEEPER
    Play_TimerCheck();                                // update the LED flashes
#endif

    int32_t PressRelease=Button_TimerCheck();         // 0 = no change
#ifdef DEBUG_PRINT
    if(PressRelease!=0)
    { xSemaphoreTake(CONS_Mutex, portMAX_DELAY);
      Format_String(CONS_UART_Write, "Button: ");
      Format_SignDec(CONS_UART_Write, PressRelease);
      Format_String(CONS_UART_Write, "ms\n");
      xSemaphoreGive(CONS_Mutex); }
#endif
    if(PressRelease>0)
    { if(PressRelease<=700)                                            // short button push: switch pages
      { KeyBuffer.Write(0x01); }
      else if(PressRelease<=3000)                                      // longer button push: some page action
      { KeyBuffer.Write(0x41); }
      else                                                             // very long push
      { }
    }

  }
}

// ======================================================================================================

int NVS_Init(void)
{ esp_err_t Err = nvs_flash_init();
  if (Err == ESP_ERR_NVS_NO_FREE_PAGES)
  { nvs_flash_erase();
    Err = nvs_flash_init(); }

  // if(Parameters.ReadFromNVS()!=ESP_OK)
  // { Parameters.setDefault(getUniqueID());
  //   Parameters.WriteToNVS(); }

  return Err; }

// ======================================================================================================

#ifdef WITH_SPIFFS

#ifdef WITH_SPIFFS_FAT // FAT replaces SPIFFS, hopefully no performace and reliability issues

int SPIFFS_Register(const char *Path, const char *Label, size_t MaxOpenFiles)
{ esp_vfs_fat_mount_config_t FSconf;
  FSconf.max_files = MaxOpenFiles;
  FSconf.format_if_mount_failed = true;
  FSconf.allocation_unit_size = 4096;
  static wl_handle_t Handle = WL_INVALID_HANDLE;
  return esp_vfs_fat_spiflash_mount(Path, Label, &FSconf, &Handle); }

int SPIFFS_Info(size_t &Total, size_t &Used, const char *Label)
{ FATFS *FS=0;
  Total=0; Used=0;
  size_t FreeClusters;
  int Ret = f_getfree("0:", &FreeClusters, &FS);
  // if(Ret=!FR_OK) return Ret;
  if(FS==0) return 0;
  size_t TotalSectors = (FS->n_fatent-2) * FS->csize;
  size_t FreeSectors = FreeClusters * FS->csize;
  Total = TotalSectors * FS->ssize;
  Used  = (TotalSectors-FreeSectors) * FS->ssize;
  return 0; }

#else // SPIFFS: gives troubles when more than few files are open

int SPIFFS_Register(const char *Path, const char *Label, size_t MaxOpenFiles)
{ esp_vfs_spiffs_conf_t FSconf =
  { base_path: Path,
    partition_label: Label,
    max_files: MaxOpenFiles,
    format_if_mount_failed: true };
  return esp_vfs_spiffs_register(&FSconf); }

int SPIFFS_Info(size_t &Total, size_t &Used, const char *Label)
{ return esp_spiffs_info(Label, &Total, &Used); }

#endif
#endif

// ======================================================================================================

SemaphoreHandle_t I2C_Mutex;

uint8_t I2C_Read(uint8_t Bus, uint8_t Addr, uint8_t Reg, uint8_t *Data, uint8_t Len, uint8_t Wait)
{ i2c_cmd_handle_t Cmd = i2c_cmd_link_create();
  i2c_master_start(Cmd);
  i2c_master_write_byte(Cmd, (Addr<<1) | I2C_MASTER_WRITE, I2C_MASTER_ACK);
  i2c_master_write_byte(Cmd, Reg, I2C_MASTER_ACK);
  i2c_master_start(Cmd);
  i2c_master_write_byte(Cmd, (Addr<<1) | I2C_MASTER_READ, I2C_MASTER_ACK);
  i2c_master_read(Cmd, Data, Len, I2C_MASTER_LAST_NACK);
  i2c_master_stop(Cmd);
  xSemaphoreTake(I2C_Mutex, portMAX_DELAY);
  esp_err_t Ret = i2c_master_cmd_begin((i2c_port_t)Bus, Cmd, Wait);
  xSemaphoreGive(I2C_Mutex);
  i2c_cmd_link_delete(Cmd);
  return Ret; }

uint8_t I2C_Write(uint8_t Bus, uint8_t Addr, uint8_t Reg, uint8_t *Data, uint8_t Len, uint8_t Wait)
{ i2c_cmd_handle_t Cmd = i2c_cmd_link_create();
  i2c_master_start(Cmd);
  i2c_master_write_byte(Cmd, (Addr<<1) | I2C_MASTER_WRITE , I2C_MASTER_ACK);
  i2c_master_write_byte(Cmd, Reg , I2C_MASTER_ACK);
  i2c_master_write(Cmd, Data, Len, I2C_MASTER_NACK);
  i2c_master_stop(Cmd);
  xSemaphoreTake(I2C_Mutex, portMAX_DELAY);
  esp_err_t Ret = i2c_master_cmd_begin((i2c_port_t)Bus, Cmd, Wait);
  xSemaphoreGive(I2C_Mutex);
  i2c_cmd_link_delete(Cmd);
  return Ret; }

uint8_t I2C_Restart(uint8_t Bus)
{ return 0; }

// ======================================================================================================

